Revit 2024 API
DirectShapeTypeOptions.IsValid Method
 Determines whether a DirectShapeTypeOptions is internally consistent (valid).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public bool IsValid()
Visual Basic
Public Function IsValid As Boolean
Visual C++
public:
bool IsValid()
Remarks
 This is currently a placeholder and always returns true. Will be made public_api and a validator when it does something useful.
See Also
DirectShapeTypeOptions Class
Autodesk.Revit.DB Namespace